Revit 2026 API

# ElectricalSystemCableType Property

---

The Cable Type of the Electrical System.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId CableType { get; set; }
```
```vb
Public Property CableType As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ CableType {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member CableType : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The id is not a Cable Type id nor invalidElementId. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

After Cable Type of the Electrical System changes, the Cable Size will be set to InvalidElementId after regeneration.

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace